{"captainVersion":2,"dockerCompose":{"services":{"$$cap_appname":{"image":"audio-transcribe","ports":["5001:5000"],"volumes":["$$cap_appname:/app/instance"],"environment":["WISPHER_MODEL=$$wispher_model","ADMIN_PASSWORD=$$admin_password"]}}},"variables":[{"id":"$$wispher_model","label":"Wispher Model","defaultValue":"base","validRegex":"/^[a-zA-Z]+$/"},{"id":"$$admin_password","label":"Admin Password","description":"Enter the admin password. Please use a string one.","validRegex":"/^(?=.*[A-Z])(?=.*[a-z])(?=.*\\d)(?=.*[@$!%*?&])[A-Za-z\\d@$!%*?&]{8,}$/","required":true}],"instructions":{"start":"Welcome to the Audio Transcribe and Comment application setup!\n\nThis application allows users to upload audio files, transcribe them into text, and add comments to specific sections of the audio.\n\nDuring the setup, please provide the following information:\n\n- **Wispher Model**: Select the transcription model to be used. Available options include 'base' and others you may define.\n- **Admin Password**: Set a strong password for the admin account. Ensure it meets the following criteria:\n    - At least 8 characters in length.\n    - Contains at least one uppercase letter (A-Z).\n    - Contains at least one lowercase letter (a-z).\n    - Includes at least one digit (0-9).\n    - Includes at least one special character (e.g., @$!%*?&).\n\nAfter providing these details, the application will be deployed, and you can access it through the assigned URL.\n","end":"Congratulations! The Audio Transcribe and Comment application has been successfully deployed.\n\nYou can now access the application at `http://$$cap_appname.$$cap_root_domain`.\n\nTo get started:\n\n1. **Upload Audio**: Use the upload feature to add your audio files.\n2. **Transcription**: The system will automatically transcribe your audio into text.\n3. **Commenting**: Highlight sections of the transcript and add your comments.\n\nFor more information and updates, visit our [GitHub repository](https://github.com/geo-petrini/audio_transcribe).\n\nThank you for using the Audio Transcribe and Comment application!\n"},"displayName":"Audio Transcribe","isOfficial":false,"description":"An application where you can upload audio files, preferably dialogues, that will then be transformed as text by the system","documentation":"More documentation can be found on the [GitHub](https://github.com/geo-petrini/audio_transcribe)"}
